// lib/data/text_content.dart

class TextContent {
  static const Map<String, String> data = {
    'ps_yaseen': """بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْمِ
یٰسٓ (1) وَالْقُرْآنِ الْحَکِیْمِ (2) اِنَّکَ لَمِنَ الْمُرْسَلِیْنَ (3) عَلٰی صِرَاطٍ مُّسْتَقِیْمٍ (4) تَنْزِیْلَ الْعَزِیْزِ الرَّحِیْمِ (5) ...""",
    
    'ps_rehman': """بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْمِ
الرَّحْمٰنُ (1) عَلَّمَ الْقُرْآنَ (2) خَلَقَ الْاِنْسَانَ (3) عَلَّمَهُ الْبَیَانَ (4) ...""",

    'ps_fatah': """بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْمِ
اِنَّا فَتَحْنَا لَکَ فَتْحًا مُّبِیْنًا (1) لِّیَغْفِرَ لَکَ اللهُ مَا تَقَدَّمَ مِنْ ذَنْبِکَ وَمَا تَاَخَّرَ وَیُتِمَّ نِعْمَتَهٗ عَلَیْکَ وَیَهْدِیَکَ صِرَاطًا مُّسْتَقِیْمًا (2) وَیَنْصُرَکَ اللهُ نَصْرًا عَزِیْزًا (3) ...""",

    'ps_darood': """بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْمِ
اَللَّهُمَّ صَلِّ عَلَى سَيّدِنَا مُحَمَّدٍ وَعَلَى الِ سَيّدِنَا مُحَمَّدٍ وَ اَصْحبہ وَبَارِكُ وَسَلِّمُ

درج ذیل درود شریف کے بے شمار فضائل میں پڑھنے کا طریقہ یہ ہے کہ جمعہ کی نماز کے بعد مدینہ طیبہ کی طرف منہ کر کے ایک سو ایک مرتبہ پڑھیں۔ چند جمعہ بھی نہ گزرنے پائیں گے کہ اس کے اثرات ظاہر ہونے شروع ہو جائیں گے۔ یہ بات تجربہ سے ثابت ہوئی ہے کہ پڑھنے والوں نے بے سرومانی کے باوجود حج بیت اللہ و زیارت رسول اللہ صل اللہ علیہ وسلم کی سعادت حاصل کی ۔

صَلَّى اللهُ عَلَى النَّبي الأمّى وَالِه صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلوةٌ و سَلامُ عَلَيْكَ يَا رَسُولَ اللهِ""",

    'ps_baqrah': """سورہ بقرہ کی آخری آیات

شہنشاہِ مدینہ سرورِ قلب و سینہ صلی اللہ تعالیٰ علیہ وآلہ وسلم نے فرمایا:
اللہ عَزَّ وَجَلَّ نے زمین و آسمان کو پیدا کرنے سے دو ہزار سال پہلے ایک کتاب لکھی پھر اس میں سے بقرہ کی آخری دو آیتیں نازل فرمائیں، جس گھر میں تین راتیں ان دو آیتوں کو پڑھا جائے گا شیطان اس گھر کے قریب نہ آئے گا۔
سلطانِ دو جہاں، مدینے کے سلطان، رحمتِ عالمیان، سرورِ ذیشان صلی اللہ تعالیٰ علیہ وآلہ وسلم نے فرمایا: ’’جو شخص (سورہ بقرہ کی آخری دو آیتیں رات میں پڑھے گا وہ اسے کفایت کریں گی۔‘‘ (صحیح البخاری حدیث ۵۰۰۹ ج ۲ ص ۴۰۵)
کفایت سے مراد یہ ہے کہ یہ دو آیتیں اس رات کے قیام کے قائم مقام ہو جائیں گی یا اس رات اسے شیطان سے محفوظ رکھیں گی یا اس رات میں نازل ہونے والی آفات سے بچائیں گی یا اسے فضیلت و ثواب کے لئے کافی ہونگی۔ واللہ تعالیٰ اعلم

بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْمِ
اللہ کے نام سے شروع جو بہت مہربان رحمت والا

آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ کُلٌّ آمَنَ بِاللَّهِ وَمَلَائِکَتِهِ وَکُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَکَ رَبَّنَا وَإِلَيْکَ الْمَصِيرُ (285)
رسول ایمان لایا اس پر جو اس کے رب کے پاس سے اس پر اترا اور ایمان والے سب نے مانا اللہ اور اس کے فرشتوں اور اس کی کتابوں اور اس کے رسولوں کو، ہم اس کے کسی رسول پر ایمان لانے میں فرق نہیں کرتے اور عرض کی کہ ہم نے سنا اور مانا، تیری معافی ہو اے رب ہمارے اور تیری ہی طرف پھرنا ہے۔

لَا يُکَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا کَسَبَتْ وَعَلَيْهَا مَا اکْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا کَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْکَافِرِينَ (286)
اللہ کسی جان پر بوجھ نہیں ڈالتا مگر اس کی طاقت بھر، اس کا فائدہ ہے جو اس نے کمایا اور اس کا نقصان ہے جو اس نے کیا، اے رب ہمارے ہمیں نہ پکڑ اگر ہم بھولیں یا چوکیں، اے رب ہمارے اور ہم پر بھاری بوجھ نہ رکھ جیسا تو نے ہم سے اگلوں پر رکھا تھا، اے رب ہمارے اور ہم پر وہ بوجھ نہ ڈال جس کی ہمیں سکت نہیں اور ہمیں معاف فرما دے اور ہمیں بخش دے اور ہم پر رحم فرما، تو ہمارا مولیٰ ہے تو ہمیں کافروں پر مدد عطا فرما۔""",
  };
}
